#include<iostream>
using namespace std;
void Sum(int(*A)[3], int(*B)[3], int n, int(*C)[3]) { /*Създаме функция void с име Sum и с формални параметри
двата пълни масива A,B и празен масив C и една променлива за циклите
указателите, които виждаш във функцията служат за да дадат достъп до стойностите на масивите.
													*/
	for (int i = 0; i < n; i++) { // обхождаме редове
		for (int j = 0; j < n; j++) { //обхожаме колони
			C[i][j] = A[i][j] + B[i][j]; // събираме елементите на масивите А и В и ги присвояваме на С
			cout << C[i][j]<<" "; // извеждаме новия масив
		}
		cout << endl; // извеждаме нов ред за да заприлича на матрица
	}
}
int main() {
	int A[3][3] = { {1,2,3}, {4,5,6}, {7,8,9} };// създаваме двумерен масив А
	int B[3][3] = { {9,8,7}, {6,5,4}, {3,2,1} };// създаваме двумерен масив В
	int C[3][3] = { {0,0,0}, {0,0,0}, {0,0,0} };// създаваме двумерен масив С

	Sum(A, B, 3, C); // Извикваме функциява Sum с нашите данни

	system("pause");

}