#include <iostream>
using namespace std;
void max(int a[10]) { // дефинираме функцията от тип void (не връща стойност) с име max и казваме какви параметри (формални) ще приема
	// в нашия случай тя ще трябва да приема масив от 5 елемента от тип INT 

	int maxy = INT_MIN; // създаваме тазу променлива и казваме да е равна на най-голямото отрицателно число
	/*
		Защо казваме maxy = –2 147 483 648(това е най-ниската стойност на INT)
		Защото което и число да дадем, то винаги ще е по-голямо от maxy и така maxy ще просвои новата стойност.
	*/
	for (int i = 1; i <= 5; i++) { // създаваме цикъл, който ще обхожда масива
		if (a[i] > maxy) { // проверка дали дадената стойност е по-голяма от maxy (винаги е по-голяма)
			maxy = a[i]; // maxy ще присвои стойността 
		}
	}
	cout << maxy << endl; // извеждаме най-голямата стойност
}
/*
	До тук какво става? - Компилатора просто прочита, че сме създали тази функция и прочита кода на функцията, но 
	тази функция не извършва никакви операции до този момент, защото не сме дали никакви данни да обработва.
	Данните сме задали в основната програма. Ние във функцията де факто сме казали тези данни от основната програма
	как да бъдат обработени.

*/
int main() { // основна програма
	
	const int n = 5; // брой елементи
	int array[n]; // създаваме масив от тип INT с 5 елемента
	for (int i = 1; i <= 5; i++) { // създаваме цикъл, който ще въвежда стойностите на масива
		cin >> array[i]; // въвеждаме стойности за масива
	} 
	// 636, 745 , 73, 3 , 556 примерни входове за масива
	cout << endl; // печатаме празен ред за да отделим изхода от входа
	max(array); //(фактически параметър) извикваме функцията с нашия масив с тези примерни стойности 636, 745 , 73, 3 , 556
	/*
	Връща се в нашата функцията и започва да обработва нашия масив и изкарва нашия резултат	
	*/
}
/*
	!!ВАЖНО!! - Фактическите параметри трябва да са от същия тип и брой като формалните!!!
	Ако не са ще даде грешка за несъотстветствие. Ние сме казали, че искаме нашата функция да приеме
	масив от тип INT с 5 елемента, и ние ТРЯБВА да му подадем масив от тип INT и до 5 елемента.
	Подадения масив трябва да е равен на броя данни които искаме или по-малко от броя, които искаме.
	Де факто ние сме казали, че искаме масив "а" с 5 елемента, тогава нашия масив "array", който ще обработваме
	трябва да е с 5 или по-малко от 5 елемента.

*/

/*
	НЕЩО СТРАНИЧНО ОТ НАШАТА ПРОГРАМА
	void max(int a, int b) - създане функция с два параметъра (формални) от тип INT, то тогава, когато извикваме
	функцията трябва да е отново с два параметъра (фактически) от този тип.
	Примерно: max(c,d);
	
	НЕ МОЖЕМ ДА ПРАВИМ СЛЕДНОТО - max(c);
*/