/*
Задача 7 - масиви СофтУни (олимпиада) - Да се напише програма, която сумира стойностите две по две и ги свежда до две суми и след това
тези две суми биват също сумирани. С пример се обяснява по-добре.
Пример: 2 10 3 --> 2+10 10+3 --> 12 13 --> 12 + 13 --> 25 (имаме три елемента в примера, тия три елемта ги сумираме до две суми и тези две суми до една сума.)
*/
#include<iostream>
using namespace std;
int main() {

	const int n = 3; // задаваме броя на стойностите
	int array[n]; // създаваме основния масив с размер n=3
	int secondArray[n]; // създаваме втори масив с размер n=3
	int sum = 0,j; // дефинираме сума и втори брояч
	for (int i = 1; i <= n; i++) { // първи цикъл за въвеждане на стойностите на основния масив
		cin >> array[i]; // въвеждаме стойности
	}
	for (int i = 1; i <= n; i++) { // втори цикъл за обхождане на стойностите
		if (i == n) { // праввим проверка ако брояча е равен на последния елемент, ако е равен ще се изведе адреса на масива, а не сумата
			break;// ако е равен програмата прекъсва
		}
		for (j = 1; j <= n-1; j++) { // имаме трети цикъл, който е вложен и служи за добавяне на стойности на втория масив
			secondArray[j] = array[i] + array[i + 1]; // събираме два по два елеманта от основния масив и ги записваме като нови стойност във втория масив
			break; // чупим кода, защото ще присвои адрес към масива
		}
		sum += secondArray[j]; // сумираме стойностите на втория масив

	}

	cout <<"The sum is: "<< sum << endl; // извеждаме сумата

	system("pause");
}
/*	1 - Втория масив служи за присвояване на сумираните стойности от първия масив.
	2 - дефинирал съм j отвън, защото после го извиквам извън блока за да сумирам стойностите от втори масив.
	3 = Break служи за да прекъсне последните операции, защото вече съм ги извикал, ако не се сложи присвоява адрес (Пример: 89037536).
*/