/*
Задача 5 - масиви от СофтУни. - Да се създаде програма, която сумира 
четните и нечетните числал в един масив и извежда разликата между двете суми.
*/


#include<iostream>
#include<cmath>
using namespace std;
int main() {
	const int n = 10; // казваме колко символа ще е масива

	int array[n]; // създавме масив от n=10(размер) елемента;
	int evenSum = 0, oddSum = 0; //създаме две суми за четни и нечетни числа

	for (int i = 1; i <= n; i++) { // В този цикъл въвеждаме стойностите на масива
		cin >> array[i]; // въвеждаме стойност
	}

	for (int i = 1; i <= n; i++) { // Този цикъл служи да обходим стойностите на масива и да определим дали са четни или нечетни
		if (array[i] % 2 == 0) { // проверяваме дали дадения елемент е четен 
			evenSum += array[i]; // ако е четен да се добави в сумата на четните числа 
		}
		else if (array[i] % 2 == 1) { // проверяваме дали дадения елемент е нечетен
			oddSum += array[i]; // ако е нечетен се добавя към сумата на нечетните числа
		}
	}

	cout << "Difference between the both sums is: " << abs(oddSum - evenSum) << endl; // извеждаме разликата между двете суми 
	// използваме abs, защото не искаме да се изведе минус ако от по-малката сума вадим по-голямата. 


}