/*
Задача 7 - масиви СофтУни (олимпиада) - Да се напише програма, която сумира стойностите един с друг и ги свъжда до две суми и след това
тези две суми биват също сумирани. С пример се обясня по-добре.
Пример: 2 10 3 --> 2+10 10+3 --> 12 13 --> 12 + 13 --> 25 (имаме три елемента в примера, тия три елемта ги сумираме до две суми и тези две суми до една сума.)
*/

#include<iostream>
using namespace std;
int main() {
	const int n = 3;
	
	int array[n];

	int sum = 0;
	int sum1 = 0, sum2 = 0;

	for (int i = 1; i <= n; i++) {
		cin >> array[i];
	}


	for (int i = 1; i <= n; i++) {
		sum1 = array[i];
		sum2 = array[i++];
		sum += (sum1 + sum2);

	}


	cout <<"The sum is: "<< sum<<endl;













	system("pause");
}