/*
Задача 6 - масиви СофтУни - Да се напише програма с два масива и да се провери дали двата масива са с равни стоийности, ако са равни
да се изведе сумата им. Ако не са равни да се изведе позицията, където се различават стойностите.
*/

#include<iostream>
using namespace std;
int main() {

	const int n = 5; // задаваме броя символи
	
	int firstArray[n]; // задаваме размера на първия масив да е равен на n=5
	int secondArray[n]; // задаме размера на втория масив да е равен на n=5
	int sum = 0; // създаваме сума, която ще се извежда ако са еднакви

	for (int i = 1; i <= n; i++) { // първи цикъл служи за въвеждане на стойностите на първия масив
		cin >> firstArray[i]; // въвеждаме стойностите на масива 
	}

	for (int i = 1; i <= n; i++) { // втори цикъл служи за въвеждане на стойностите на втория масив
		cin >> secondArray[i]; // въвеждаме стойнистите на масива
	}

	for (int i = 1; i <= n; i++) { // трети цикъл служи за обхождане и на двата масива, защото са с еднакъв размер
		if (firstArray[i] == secondArray[i]) { //проверка ако стойност на първия масив е равна на стойност от втория масив на същата позиция
			sum += firstArray[i]; // добавяме стойност към сумата ако са равни стойностите
		}
		else if (firstArray[i] != secondArray[i]) { // проверка ако стойност на първия масив е различна от стойност на втория масив на една и съща позиция
			cout << "They are not equal! In position " << i << " has difference" << endl; // извеждаме това съобшение и позицията къдете елементите са различни
			return 0; // директно програмата свършва ако стойности на една и съща позиция на двата масива са различни
		}
	}
	cout << "They are equal, and the sum is: " << sum << endl; // ако всички стойности на позициите са еднакви се извежда това съобшения плюс сумата
	system("pause");
}


